#+OPTIONS: toc:t H:3
#+AUTHOR: Luis404
#+EMAIL: luisxu404@gmail.com

#+TITLE: 跑步日志* 关于跑步
爱好不多, 跑步算得上一个. 虽然越跑越胖, 但仍然断断续续坚持着, 无论如何, 对身体总是好的.

跑过几次[[http://xuzhengchao.com/life/%E7%AC%AC%E4%BA%8C%E6%AC%A1%E5%8C%97%E4%BA%AC%E9%A9%AC%E6%8B%89%E6%9D%BE.html][马拉松]], 成绩都烂的很, 后半程总是以走为主. 不过心态略好, 仍然一年年的跑. 

从肉体上讲, 每次跑马拉松对我都是一次"生不如死"的折磨, 尤其是30公里以后, 
那种呼吸都会全身疼痛的肉体折磨, 更能考验精神力量. "放弃还是坚持, it's a question".

这就是马拉松对于我的意义, 把一身的骨头肌肉折磨到极限, 然后用精神力量控制肉体到达终点.\\
跑完之后会有一种"老子又浴火重生了一次"的快感.\\
期待能一直跑到老, 然后跑进一次四小时. O(∩_∩)O~

该文是跑步的一个记录. [[http://xuzhengchao.com/lisp/add-running-record.html][偷闲用Emacs Lisp写了一个程序]]. 用Emacs命令的方式添加记录, 再结合
emacs的快捷键, 一步到位更新blog, 也是蛮酷的.

*** 2016年
  | 日期    | 距离(KM) | 地点  |
  |---------+----------+-------|
  | 04.19   |      5.0 | 首体  |
  | Apr. 15 |      3.0 | 首体  |
  | Apr. 13 |      6.0 | 首体  |
  | Apr. 3  |      5.0 | CUPES |
  | Mar. 30 |      6.0 | CUPES |
  | Mar. 17 |      6.6 | 首体  |
  | Mar. 10 |      6.0 | 首体  |
  | Feb. 24 |      2.5 | 首体  |
  | Feb. 18 |      3.0 | 首体  |
  | Feb. 15 |      7.0 | 首体  |
  | Feb. 2  |      5.0 | 首体  |
  | Jan. 19 |      6.0 | 首体  |
  | Jan. 15 |      6.0 | 首体  |
  | Jan. 11 |      6.6 | 首体  |
  | Jan. 8  |      6.0 | 首体  |
  |---------+----------+-------|
  | 年度    |          |       |

*** 2015年
  | 日期    | 距离(KM) | 地点     |
  |---------+----------+----------|
  | Jan. 20 |        4 | 长岛澜桥 |
  | Jan. 21 |        4 | 长岛澜桥 |
  | Jan. 27 |      1.2 | 健身房   |
  | Jan. 28 |    5+1.2 | 健身房   |
  | Jan. 29 |    5+1.4 | 健身房   |
  | Jan. 31 |    5+1.2 | 健身房   |
  | Feb. 3  |      1.2 | 健身房   |
  | Mar. 1  |        2 | 健身房   |
  | Mar. 2  |        5 | 健身房   |
  | Mar. 3  |        2 | 健身房   |
  | Mar. 4  |        5 | 健身房   |
  | Mar. 5  |        2 | 健身房   |
  | Mar. 6  |        5 | 健身房   |
  | Mar. 9  |        2 | 健身房   |
  | Apr. 1  |        2 | 南湖公园 |
  | Apr. 22 |        4 | 央美     |
  | Apr. 25 |      3.6 | 央美     |
  | Apr. 27 |      5.2 | 北航     |
  | May. 4  |        5 | 北航     |
  | May. 8  |        6 | 北航     |
  | Dec. 7  |        4 | 首体     |
  | Dec. 8  |        5 | 首体     |
  | Dec. 12 |       10 | 首体     |
  | Dec. 15 |        5 | 首体     |
  |---------+----------+----------|
  | 年度    |     102. |          |
  #+TBLFM: $2=vsum(@2..@25)

*** 2014年
  | 日期     | 距离(KM) | 地点                              |
  |----------+----------+-----------------------------------|
  | Mar. 19  |        5 | 中央美术学院                      |
  | Mar. 22  |      8.6 | 健身房                            |
  | Mar. 29  |       12 | 健身房                            |
  | Apr. 22  |      7.4 | 健身房                            |
  | Apr. 27  |        9 | 健身房                            |
  | May. 4   |        5 | 中央美术学院                      |
  | May. 6   |       15 | 公司                              |
  | May. 8   |        5 | 公司                              |
  | May. 10  |       10 | 公司                              |
  | May. 13  |       15 | 公司                              |
  | May. 15  |        8 | 公司                              |
  | May. 16  |      5.0 | 公司                              |
  | May. 20  |      5.0 | 公司                              |
  | May. 23  |     10.0 | 公司                              |
  | May. 26  |     12.0 | 公司                              |
  | May. 30  |     15.0 | 公司                              |
  | July. 17 |      6.9 | 公司                              |
  | July. 18 |      7.1 | 公司                              |
  | July. 22 |      6.0 | 公司                              |
  | Aug. 19  |      5.0 | 公司                              |
  | Aug. 20  |      5.0 | 公司                              |
  | Aug. 22  |      5.0 | 公司                              |
  | Oct. 19  |   42.195 | 天安门-奥体中心(3rd北马, 5:47:22) |
  |----------+----------+-----------------------------------|
  | 年度     |  224.195 |                                   |
*** 2013年 
  | 日期    | 距离(KM) | 地点                              |
  |---------+----------+-----------------------------------|
  | Oct. 20 |   42.195 | 天安门-奥体中心(2nd北马, 4:51:45) |
*** 2012年 
  | 日期    | 距离(KM) | 地点                                 |
  |---------+----------+--------------------------------------|
  | Nov. 25 |   42.195 | 天安门-奥体中心(1st北马, 5:30:26) |
